Repository: MehtiSini/AvaPMIS
Catalog: shared/Nozhan.Abp.Utilities/Resources/FrameworkValidationMessages.*.resx
Languages: fa_ir

# EmailDuplicateError
source: A user is registerd with entered email before
fa_ir: کاربری قبلا با ایمیل وارد شده ثبت نام کرده است.

# EmailFormatError
source: You have entered an invalid email address
fa_ir: آدرس ایمیل وارد شده معتبر نمی باشد.

# EndDateRequiredError
source: End Date is required
fa_ir: تاریخ انتهای بازه باید مشخص شود.

# ErrorReadingDataFromServerError
source: Error reading data from server!
fa_ir: خطا در هنگام خواندن اطلاعات از سرور

# ExceptionOccuredError
source: An error has been occured : {0}
fa_ir: متاسفانه خطایی رخ داد :{0}

# FieldRequiredError
source: Field {0} is required.
fa_ir: مشخص کردن {0} الزامی می باشد.

# IdRequiredError
source: ID is required Error
fa_ir: شماره شناسایی باید وارد شود

# InvalidCodingError
source: The value {0} provided for {1} is not valid.
fa_ir: مقدار {0} برای {۱} معتبر نیست

# InvalidDateError
source: The value specified for date is invalid
fa_ir: مقدار تعیین شده برای تاریخ نامعتبر می باشد.

# InvalidDateTimeError
source: Entered datetime is invalid
fa_ir: تاریخ وارد شده نامعتبر می باشد.

# InvalidFieldError
source: The value specified for {0} is invalid
fa_ir: مقدار تعیین شده برای {0} نامعتبر می باشد.

# InvalidFormatError
source: The value specified for {0} is invalid
fa_ir: فرمت مقدار وارد شده برای {0{ صحیح نمی باشد.

# InvalidMobileNumberError
source: You have entered an invalid mobile number
fa_ir: شماره همراه وارد شده صحیح نمیباشد.

# InvalidNationalCodeError
source: You have entered an invalid national code
fa_ir: کد ملی وارد شده صحیح نمیباشد.

# InvalidPhoneNumberAttribute
source: You have entered an invalid phone number
fa_ir: شماره تلفن وارد شده صحیح نمیباشد.

# InvalidPostalCodeError
source: You have entered an invalid postal code
fa_ir: کد پستی وارد شده صحیح نمیباشد.

# InvalidShabaCodeError
source: You have entered an invalid shaba code
fa_ir: کد شبا وارد شده صحیح نمیباشد.

# InvalidShetabCardError
source: You have entered an invalid shetab card number
fa_ir: شماره کارت وارد شده صحیح نمیباشد.

# RequiredEnumValidatorError
source: The value {0} is not valid for {1}
fa_ir: مقدار {0} برای {۱} معتبر نیست

# SettingKeyNotFoundError
source: Key not found!
fa_ir: تنظیمی با این کلید یافت نشد!

# StringLengthError
source: The {0} must be at least {2} characters and maximum {1} characters long.
fa_ir: {0} باید حداکثر دارای {1} و حداقل دارای {2} باشد. کاراکتر باشد.

# StringLengthErrorIncludingMinimum
source: The {0} must be at least {2} characters and maximum {1} characters long.
fa_ir: {0} باید حداکثر دارای {1} و حداقل دارای {2} باشد. کاراکتر باشد.

# ValueCannotBeEmptyError
source: The value for {0} cannot be empty
fa_ir: {0} نمی تواند خالی باشد.

# ValueCannotBeNullError
source: The value for {0} cannot be null
fa_ir: {0} باید حتما شامل مقدار باشد.

# ValueOutOfRangeError
source: The value {0} for {1} is outside the range of allowed value.
fa_ir: مقدار {0} برای {1} خارج از محدوده مجاز می باشد.
